keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGpt12_regdef.h
/** \\brief  Capture and Reload Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_CAPREL_Bits B;
} Ifx_GPT12_CAPREL;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_CLC_Bits B;
} Ifx_GPT12_CLC;

/** \\brief  Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_ID_Bits B;
} Ifx_GPT12_ID;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_KRST0_Bits B;
} Ifx_GPT12_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_KRST1_Bits B;
} Ifx_GPT12_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_KRSTCLR_Bits B;
} Ifx_GPT12_KRSTCLR;

/** \\brief  OCDS Control and Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_OCS_Bits B;
} Ifx_GPT12_OCS;

/** \\brief  Port Input Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_PISEL_Bits B;
} Ifx_GPT12_PISEL;

/** \\brief  Timer T2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T2_Bits B;
} Ifx_GPT12_T2;

/** \\brief  Timer T2 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T2CON_Bits B;
} Ifx_GPT12_T2CON;

/** \\brief  Timer T3 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T3_Bits B;
} Ifx_GPT12_T3;

/** \\brief  Timer T3 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T3CON_Bits B;
} Ifx_GPT12_T3CON;

/** \\brief  Timer T4 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T4_Bits B;
} Ifx_GPT12_T4;

/** \\brief  Timer T4 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T4CON_Bits B;
} Ifx_GPT12_T4CON;

/** \\brief  Timer T5 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T5_Bits B;
} Ifx_GPT12_T5;

/** \\brief  Timer T5 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T5CON_Bits B;
} Ifx_GPT12_T5CON;

/** \\brief  Timer T6 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T6_Bits B;
} Ifx_GPT12_T6;

/** \\brief  Timer T6 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_GPT12_T6CON_Bits B;
} Ifx_GPT12_T6CON;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gpt12_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  GPT12 object */
typedef volatile struct _Ifx_GPT12
{
    Ifx_GPT12_CLC CLC;                      /**< \brief 0, Clock Control Register */
    Ifx_GPT12_PISEL PISEL;                  /**< \brief 4, Port Input Select Register */
    Ifx_GPT12_ID ID;                        /**< \brief 8, Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_GPT12_T2CON T2CON;                  /**< \brief 10, Timer T2 Control Register */
    Ifx_GPT12_T3CON T3CON;                  /**< \brief 14, Timer T3 Control Register */
    Ifx_GPT12_T4CON T4CON;                  /**< \brief 18, Timer T4 Control Register */
    Ifx_GPT12_T5CON T5CON;                  /**< \brief 1C, Timer T5 Control Register */
    Ifx_GPT12_T6CON T6CON;                  /**< \brief 20, Timer T6 Control Register */
    unsigned char reserved_24[12];          /**< \brief 24, \internal Reserved */
    Ifx_GPT12_CAPREL CAPREL;                /**< \brief 30, Capture and Reload Register */
    Ifx_GPT12_T2 T2;                        /**< \brief 34, Timer T2 Register */
    Ifx_GPT12_T3 T3;                        /**< \brief 38, Timer T3 Register */
    Ifx_GPT12_T4 T4;                        /**< \brief 3C, Timer T4 Register */
    Ifx_GPT12_T5 T5;                        /**< \brief 40, Timer T5 Register */
    Ifx_GPT12_T6 T6;                        /**< \brief 44, Timer T6 Register */
    unsigned char reserved_48[160];         /**< \brief 48, \internal Reserved */
    Ifx_GPT12_OCS OCS;                      /**< \brief E8, OCDS Control and Status Register */
    Ifx_GPT12_KRSTCLR KRSTCLR;              /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_GPT12_KRST1 KRST1;                  /**< \brief F0, Kernel Reset Register 1 */
    Ifx_GPT12_KRST0 KRST0;                  /**< \brief F4, Kernel Reset Register 0 */
    Ifx_GPT12_ACCEN1 ACCEN1;                /**< \brief F8, Access Enable Register 1 */
    Ifx_GPT12_ACCEN0 ACCEN0;                /**< \brief FC, Access Enable Register 0 */
} Ifx_GPT12;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGPT12_REGDEF_H */
